# @copyright Сакун Владислав Олександрович ФІТ 2-4
# Лабораторна №2
# Варіант 24 - 3x^4-2x^3-x^2+x-4=0

# Лямбда функція для знаходження f(x)
f = lambda x: 3 * x ** 4 - 2 * x ** 3 - x ** 2 + x - 4


# метод половинного ділення
def half_dividing_method():
    # Приклад значень а та b
    a = -1.2
    b = -1
    # точність
    e = 0.0001

    # Знаходимо f(a)
    fa = f(a)
    # Знаходимо f(b)
    fb = f(b)

    # Перевіряємо, що на проміжку від а до b функція приймає різних знаків f(a) * f(b) < 0
    if fa * fb < 0:
        c = (a + b) / 2
        fc = f(c)

        # Робимо ітерації поки значення функції f(c) за модулем не буде більше e
        while abs(fc) > e:
            c = (a + b) / 2
            fc = f(c)

            # f(a) * f((a+b)/2)
            if fa * fc < 0:
                b = c
            else:
                a = c
        print(f"x = {c}")
    else:
        print("Немає коренів")


# метод хорд
def secant():
    # Приклад значень а та b
    a = -1.2
    b = -1
    # точність
    e = 0.0001

    # Знаходимо f(a)
    fa = f(a)
    # Знаходимо f(b)
    fb = f(b)

    # Перевіряємо, що на проміжку від а до b функція приймає різних знаків f(a) * f(b) < 0
    if fa * fb < 0:
        c = a - fa * (b - a) / (fb - fa)
        fc = f(c)

        # Робимо ітерації поки значення функції f(x) за модулем не буде більше e
        while abs(fc) > e:
            c = a - fa * (b - a) / (fb - fa)
            fc = f(c)

            if fa * fc < 0:
                a = a
                b = c
            elif fb * fc < 0:
                a = c
                b = b
            elif fc == 0:
                print(f"x = {c}")
            else:
                print("Метод хорд не спрацював")
        print(f"x = {c}")
    else:
        print("Немає коренів")


if __name__ == '__main__':
    half_dividing_method()
    secant()
